# Без использования collections, написать программу, которая будет создавать словарь для
# подсчитывания количества вхождений каждой буквы в текст введенный с клавиатуры

text = input()
а = text[]
letters = {for a in range(0, len(text))}
total = text.count(a, 0, len(text)-1)
result ={'letters': 'total'}
print(result.items)

