# Код Морзе для представления цифр и букв использует тире и точки. Напишите
# функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
# (словари в помощь)

def morse() -> str:
    text = input()
    text1 = text.upper()
    code = {'A': '.-', 'B': '-...', 'C': '-.-.',
           'D': '-..', 'E': '.', 'F': '..-.',
           'G': '--.', 'H': '....', 'I': '..',
           'J': '.---', 'K': '-.-', 'L': '.-..',
           'M': '--', 'N': '-.', 'O': '---',
           'P': '.--.', 'Q': '--.-', 'R': '.-.',
           'S': '...', 'T': '-', 'U': '..-',
           'V': '...-', 'W': '.--', 'X': '-..-',
           'Y': '-.--', 'Z': '--..',
           '0': '-----', '1': '.----', '2': '..---',
           '3': '...--', '4': '....-', '5': '.....',
           '6': '-....', '7': '--...', '8': '---..',
           '9': '----.'}
    i = 0
    while i < len(text1):
        if text1[i] != " ":
            print(code[text1[i]], end=" ")
        else:
            print("/", end=" ")
        i += 1



morse()
